
  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   16.1   Copyright 1985-2019 StataCorp LLC
  Statistics/Data analysis            StataCorp
                                      4905 Lakeway Drive
                                      College Station, Texas 77845 USA
                                      800-STATA-PC        https://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

Stata license: 5-user network perpetual
Serial number: 501606316764
  Licensed to: LDI Econ Cornell University
               Ithaca, NY

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.

. do 00_04_cbp_readin.do 

. /* will readin in select years of CBP data */
. 
. include "../config.do"

. /*  config.do */
. 
. 
. 
. if ( "`c(hostname)'" == "ecco.vrdc.cornell.edu" ) {
. global root "/ssgprojects/project0002/MobZ.new"
. }

. 
. if ( "`c(username)'" == "vilhuber" ) {
. global root "/home/vilhuber/Workspace/git/larsvilhuber/MobZ"
. }

. 
. if ( "`c(hostname)'" == "some.server.at.census" ) {
. global root "/made/up/path/Mobz"
. }

. 
. /* check if the author creates a log file. If not, adjust the following code 
> fragment */
. 
. local c_date = c(current_date)

. local cdate = subinstr("`c_date'", " ", "_", .)

. local c_time = c(current_time)

. local ctime = subinstr("`c_time'", ":", "_", .)

. 
. // log using "${root}/logfile_`cdate'-`ctime'.log", replace text
. 
. /* It will provide some info about how and when the program was run */
. /* See https://www.stata.com/manuals13/pcreturn.pdf#pcreturn */
. local variant = cond(c(MP),"MP",cond(c(SE),"SE",c(flavor)) )  

. // alternatively, you could use 
. // local variant = cond(c(stata_version)>13,c(real_flavor),"NA")  
. 
. di "=== SYSTEM DIAGNOSTICS ==="
=== SYSTEM DIAGNOSTICS ===

. di "Stata version: `c(stata_version)'"
Stata version: 16.1

. di "Updated as of: `c(born_date)'"
Updated as of: 30 Jun 2020

. di "Variant:       `variant'"
Variant:       IC

. di "Processors:    `c(processors)'"
Processors:    1

. di "OS:            `c(os)' `c(osdtl)'"
OS:            Unix 

. di "Machine type:  `c(machine_type)'"
Machine type:  PC (64-bit x86-64)

. di "=========================="
==========================

. 
. 
. 
. 
. /* define relative libraries */
. 
. global paperdir "${root}/paper"

. global interwrk "${root}/data/interwrk"

. global raw "${root}/raw"

. global temp "${root}/temp"

. global outputs "${root}/data"

. global programs "${root}/programs"

. global outgraphs "${root}/figures"

. global logdir "${programs}/logs"

. 
. cap mkdir "$logdir"

. log using "${logdir}/logfile_`cdate'-`ctime'.log", replace text
(note: file /ssgprojects/project0002/MobZ.new/programs/logs/logfile_17_Aug_2020
> -08_14_32.log not found)
-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /ssgprojects/project0002/MobZ.new/programs/logs/logfile_17_Aug_202
> 0-08_14_32.log
  log type:  text
 opened on:  17 Aug 2020, 08:14:32

. cap mkdir "$temp"

. cap mkdir "${root}/data"

. cap mkdir "$interwrk"

. cap mkdir "$raw"

. cap mkdir "$outputs"

. 
. /* install any packages locally */
. capture mkdir "${programs}/ado"

. sysdir set PERSONAL "${programs}/ado/personal"

. sysdir set PLUS     "${programs}/ado/plus"

. sysdir set SITE     "${programs}/ado/site"

. sysdir
   STATA:  /usr/local/stata16/
    BASE:  /usr/local/stata16/ado/base/
    SITE:  /ssgprojects/project0002/MobZ.new/programs/ado/site/
    PLUS:  /ssgprojects/project0002/MobZ.new/programs/ado/plus/
PERSONAL:  /ssgprojects/project0002/MobZ.new/programs/ado/personal/
OLDPLACE:  ~/ado/

. 
. /* define data sources */
. 
. /* QCEW */
. /* data/working/mobz/qcew */
.     global qcewdata "${raw}/qcew"  

. /* /data/working/mobz/outputs */
.     global czonedata "$outputs"  

. 
. /* ADH */
.     global adhdata "${raw}/adh_data/Public Release Data/dta"

. /* CZONE */
.     global czonedata "${raw}/adh_data/"

. /* files provided separately by David Dorn */
.     global dorndata "${raw}/ddorn/"

. 
. /* CBP */
.     /* this is where the raw Stata versions of CBP data reside */
.    global cbpdata "/data/clean/cbp"

. 
. 
. 
. use "$cbpdata/cbp1990_co.dta", clear

. keep if sic=="20--"
(960,076 observations deleted)

. desc

Contains data from /data/clean/cbp/cbp1990_co.dta
  obs:         3,114                          
 vars:            26                          26 Jun 2020 10:40
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
fipstate        str2    %9s                   FIPS State Code
fipscty         str3    %9s                   FIPS County Code
sic             str4    %9s                   Industry Code - 4-digit SIC code.
empflag         str1    %9s                   Data Suppression Flag
emp             long    %12.0g                Total Mid-March Employees with
                                                Noise
qp1             long    %12.0g                Total First Quarter Payroll
                                                ($1,000) with Noise
ap              long    %12.0g                Total Annual Payroll ($1,000)
                                                with Noise
est             long    %12.0g                Total Number of Establishments
n1_4            long    %12.0g                Number of Establishments: 1-4
                                                Employee Size Class
n5_9            long    %12.0g                Number of Establishments: 5-9
                                                Employee Size Class
n10_19          int     %8.0g                 Number of Establishments: 10-19
                                                Employee Size Class
n20_49          int     %8.0g                 Number of Establishments: 20-49
                                                Employee Size Class
n50_99          int     %8.0g                 Number of Establishments: 50-99
                                                Employee Size Class
n100_249        int     %8.0g                 Number of Establishments: 100-249
                                                Employee Size Class
n250_499        int     %8.0g                 Number of Establishments: 250-499
                                                Employee Size Class
n500_999        int     %8.0g                 Number of Establishments: 500-999
                                                Employee Size Class
n1000           int     %8.0g                 Number of Establishments: 1,000
                                                or More Employee Size Class
n1000_1         byte    %8.0g                 Number of Establishments:
                                                Employment Size Class:
                                                1,000-1,499 Employees
n1000_2         byte    %8.0g                 Number of Establishments:
                                                Employment Size Class:
                                                1,500-2,499 Employees
n1000_3         byte    %8.0g                 Number of Establishments:
                                                Employment Size Class:
                                                2,500-4,999 Employees
n1000_4         byte    %8.0g                 Number of Establishments:
                                                Employment Size Class: 5,000 or
                                                More Employees
censtate        byte    %8.0g                 Census State Code
cencty          int     %8.0g                 Census County Code
year            int     %8.0g                 Year
naics           str6    %9s                   Industry Code - 6-digit NAICS
                                                code.
empflag_num     float   %9.0g                 Data Suppression Flag (numeric)
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.

. 
. gen fips = fipstate*1000 + fipscty

. tostring fips, replace force
fips already string; no replace

. replace fips = "0" + fips if length(fips) == 4
(0 real changes made)

. 
. /* replace emp if empflag has certain value */
. 
. replace emp = 10 if empflag == "A"
(158 real changes made)

. replace emp = 60 if empflag == "B"
(135 real changes made)

. replace emp = 175 if empflag == "C"
(55 real changes made)

. replace emp = 375 if empflag == "E"
(44 real changes made)

. replace emp = 750 if empflag == "F"
(47 real changes made)

. replace emp = 1750 if empflag == "G"
(38 real changes made)

. replace emp = 3750 if empflag == "H"
(18 real changes made)

. replace emp = 7500 if empflag == "I"
(2 real changes made)

. replace emp = 17500 if empflag == "J"
(2 real changes made)

. replace emp = 37500 if empflag == "K"
(0 real changes made)

. replace emp = 75000 if empflag == "L"
(1 real change made)

. 
. sum emp,d

          Total Mid-March Employees with Noise    
-------------------------------------------------------------
      Percentiles      Smallest
 1%           10              4
 5%           10              5
10%           60              6       Obs               3,114
25%          339              6       Sum of Wgt.       3,114

50%       1401.5                      Mean           6175.004
                        Largest       Std. Dev.      24081.34
75%         4345         249977
90%        12366         282433       Variance       5.80e+08
95%        24007         477360       Skewness       19.92134
99%        78037         875837       Kurtosis       611.7694

. 
. keep year fips emp 

. rename emp manu_emp_cbp

. 
. tempfile cbp90 

. save `cbp90', replace
(note: file /tmp/St20913.000001 not found)
file /tmp/St20913.000001 saved

. 
. use "$cbpdata/cbp2000_co.dta", clear

. keep if naics=="31----"
(2,174,120 observations deleted)

. desc

Contains data from /data/clean/cbp/cbp2000_co.dta
  obs:         3,067                          
 vars:            26                          26 Jun 2020 10:46
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
fipstate        str2    %9s                   FIPS State Code
fipscty         str3    %9s                   FIPS County Code
naics           str6    %9s                   Industry Code - 6-digit NAICS
                                                code.
empflag         str1    %9s                   Data Suppression Flag
emp             long    %12.0g                Total Mid-March Employees with
                                                Noise
qp1             long    %12.0g                Total First Quarter Payroll
                                                ($1,000) with Noise
ap              long    %12.0g                Total Annual Payroll ($1,000)
                                                with Noise
est             long    %12.0g                Total Number of Establishments
n1_4            long    %12.0g                Number of Establishments: 1-4
                                                Employee Size Class
n5_9            long    %12.0g                Number of Establishments: 5-9
                                                Employee Size Class
n10_19          int     %8.0g                 Number of Establishments: 10-19
                                                Employee Size Class
n20_49          int     %8.0g                 Number of Establishments: 20-49
                                                Employee Size Class
n50_99          int     %8.0g                 Number of Establishments: 50-99
                                                Employee Size Class
n100_249        int     %8.0g                 Number of Establishments: 100-249
                                                Employee Size Class
n250_499        int     %8.0g                 Number of Establishments: 250-499
                                                Employee Size Class
n500_999        int     %8.0g                 Number of Establishments: 500-999
                                                Employee Size Class
n1000           int     %8.0g                 Number of Establishments: 1,000
                                                or More Employee Size Class
n1000_1         byte    %8.0g                 Number of Establishments:
                                                Employment Size Class:
                                                1,000-1,499 Employees
n1000_2         byte    %8.0g                 Number of Establishments:
                                                Employment Size Class:
                                                1,500-2,499 Employees
n1000_3         byte    %8.0g                 Number of Establishments:
                                                Employment Size Class:
                                                2,500-4,999 Employees
n1000_4         byte    %8.0g                 Number of Establishments:
                                                Employment Size Class: 5,000 or
                                                More Employees
censtate        byte    %8.0g                 Census State Code
cencty          int     %8.0g                 Census County Code
year            int     %8.0g                 Year
sic             str4    %9s                   Industry Code - 4-digit SIC code.
empflag_num     float   %9.0g                 Data Suppression Flag (numeric)
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.

. 
. gen fips = fipstate*1000 + fipscty

. tostring fips, replace force
fips already string; no replace

. replace fips = "0" + fips if length(fips) == 4
(0 real changes made)

. 
. /* replace emp if empflag has certain value */
. 
. replace emp = 10 if empflag == "A"
(134 real changes made)

. replace emp = 60 if empflag == "B"
(124 real changes made)

. replace emp = 175 if empflag == "C"
(46 real changes made)

. replace emp = 375 if empflag == "E"
(30 real changes made)

. replace emp = 750 if empflag == "F"
(16 real changes made)

. replace emp = 1750 if empflag == "G"
(19 real changes made)

. replace emp = 3750 if empflag == "H"
(2 real changes made)

. replace emp = 7500 if empflag == "I"
(1 real change made)

. replace emp = 17500 if empflag == "J"
(0 real changes made)

. replace emp = 37500 if empflag == "K"
(0 real changes made)

. replace emp = 75000 if empflag == "L"
(0 real changes made)

. 
. sum emp,d 

          Total Mid-March Employees with Noise    
-------------------------------------------------------------
      Percentiles      Smallest
 1%           10              2
 5%           14              4
10%           60              4       Obs               3,067
25%          333              5       Sum of Wgt.       3,067

50%         1459                      Mean           5373.435
                        Largest       Std. Dev.      17808.16
75%         4529         204393
90%        11463         223025       Variance       3.17e+08
95%        20382         340630       Skewness       17.56102
99%        60448         608230       Kurtosis       491.8224

. 
. keep year fips emp 

. rename emp manu_emp_cbp

. 
. tempfile cbp00

. save `cbp00', replace
(note: file /tmp/St20913.000002 not found)
file /tmp/St20913.000002 saved

. 
. use "$cbpdata/cbp2007_co.dta", clear

. keep if naics=="31----"
(2,213,690 observations deleted)

. desc

Contains data from /data/clean/cbp/cbp2007_co.dta
  obs:         3,080                          
 vars:            32                          26 Jun 2020 10:52
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
fipstate        str2    %9s                   FIPS State Code
fipscty         str3    %9s                   FIPS County Code
naics           str6    %9s                   Industry Code - 6-digit NAICS
                                                code.
empflag         str1    %9s                   Data Suppression Flag
emp_nf          str1    %9s                   Total Mid-March Employees Noise
                                                Flag
emp             long    %12.0g                Total Mid-March Employees with
                                                Noise
qp1_nf          str1    %9s                   Total First Quarter Payroll Noise
                                                Flag
qp1             long    %12.0g                Total First Quarter Payroll
                                                ($1,000) with Noise
ap_nf           str1    %9s                   Total Annual Payroll Noise Flag
ap              long    %12.0g                Total Annual Payroll ($1,000)
                                                with Noise
est             long    %12.0g                Total Number of Establishments
n1_4            long    %12.0g                Number of Establishments: 1-4
                                                Employee Size Class
n5_9            long    %12.0g                Number of Establishments: 5-9
                                                Employee Size Class
n10_19          int     %8.0g                 Number of Establishments: 10-19
                                                Employee Size Class
n20_49          int     %8.0g                 Number of Establishments: 20-49
                                                Employee Size Class
n50_99          int     %8.0g                 Number of Establishments: 50-99
                                                Employee Size Class
n100_249        int     %8.0g                 Number of Establishments: 100-249
                                                Employee Size Class
n250_499        int     %8.0g                 Number of Establishments: 250-499
                                                Employee Size Class
n500_999        int     %8.0g                 Number of Establishments: 500-999
                                                Employee Size Class
n1000           int     %8.0g                 Number of Establishments: 1,000
                                                or More Employee Size Class
n1000_1         byte    %8.0g                 Number of Establishments:
                                                Employment Size Class:
                                                1,000-1,499 Employees
n1000_2         byte    %8.0g                 Number of Establishments:
                                                Employment Size Class:
                                                1,500-2,499 Employees
n1000_3         byte    %8.0g                 Number of Establishments:
                                                Employment Size Class:
                                                2,500-4,999 Employees
n1000_4         byte    %8.0g                 Number of Establishments:
                                                Employment Size Class: 5,000 or
                                                More Employees
censtate        byte    %8.0g                 Census State Code
cencty          int     %8.0g                 Census County Code
year            int     %8.0g                 Year
sic             str4    %9s                   Industry Code - 4-digit SIC code.
empflag_num     float   %9.0g                 Data Suppression Flag (numeric)
emp_nf_num      float   %9.0g                 Total Mid-March Employees Noise
                                                Flag (numeric)
qp1_nf_num      float   %9.0g                 Total First Quarter Payroll Noise
                                                Flag (numeric)
ap_nf_num       float   %9.0g                 Total Annual Payroll Noise Flag
                                                (numeric)
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.

. 
. gen fips = fipstate*1000+fipscty

. tostring fips, replace force
fips already string; no replace

. replace fips = "0" + fips if length(fips) == 4 
(0 real changes made)

. 
. /* replace emp if empflag has certain value */
. 
. replace emp = 10 if empflag == "A"
(161 real changes made)

. replace emp = 60 if empflag == "B"
(162 real changes made)

. replace emp = 175 if empflag == "C"
(106 real changes made)

. replace emp = 375 if empflag == "E"
(90 real changes made)

. replace emp = 750 if empflag == "F"
(80 real changes made)

. replace emp = 1750 if empflag == "G"
(91 real changes made)

. replace emp = 3750 if empflag == "H"
(27 real changes made)

. replace emp = 7500 if empflag == "I"
(14 real changes made)

. replace emp = 17500 if empflag == "J"
(4 real changes made)

. replace emp = 37500 if empflag == "K"
(1 real change made)

. replace emp = 75000 if empflag == "L"
(0 real changes made)

. 
. sum emp, d

          Total Mid-March Employees with Noise    
-------------------------------------------------------------
      Percentiles      Smallest
 1%           10              2
 5%           10              6
10%           60              7       Obs               3,080
25%          286              8       Sum of Wgt.       3,080

50%         1233                      Mean           4341.188
                        Largest       Std. Dev.       13507.2
75%         3750         159055
90%         9836         165654       Variance       1.82e+08
95%        17500         230707       Skewness       16.63316
99%        50176         456722       Kurtosis       458.2675

. 
. keep year fips emp 

. rename emp manu_emp_cbp

. 
. tempfile cbp07

. save `cbp07', replace
(note: file /tmp/St20913.000003 not found)
file /tmp/St20913.000003 saved

. 
. /***************************************/
. 
. append using `cbp00'

. append using `cbp90'

. 
. 
. tab year 

       Year |      Freq.     Percent        Cum.
------------+-----------------------------------
       1990 |      3,114       33.62       33.62
       2000 |      3,067       33.12       66.74
       2007 |      3,080       33.26      100.00
------------+-----------------------------------
      Total |      9,261      100.00

. sort fips year

. 
. save "$interwrk/cbp_allyears.dta", replace
file /ssgprojects/project0002/MobZ.new/data/interwrk/cbp_allyears.dta saved

. 
end of do-file
